УТ.УчетЗадач/src/InformationRegisters/cbr_НастройкиПользователейКолонокКанБан/cbr_НастройкиПользователейКолонокКанБан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_НастройкиПользователейКолонокКанБан</name>
  <resources>
    <name>НастройкиКолонки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.cbr_Цвета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Доска</name>
    <type>
      <types>CatalogRef.cbr_Доски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_НастройкиПользователейКолонокКанБан/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКолонкуПользователя(Пользователь, Доска, НастройкиКолонки, Наименование, Цвет, 
	Номер = Неопределено) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.Доска.Установить(Доска);
	Если Номер <> Неопределено Тогда
		Набор.Отбор.Номер.Установить(Номер);
	КонецЕсли;
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.НастройкиКолонки = НастройкиКолонки;
		Запись.Наименование = Наименование;
		Запись.Цвет = Цвет;
	Иначе
		Запись = Набор.Добавить();
		Запись.Пользователь = Пользователь;
		Запись.Доска = Доска;
		Запись.Номер = Номер;
		Запись.Цвет = Цвет;
		Запись.Наименование = Наименование;
		Запись.НастройкиКолонки = НастройкиКолонки;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

Процедура ЗаписатьКолонкуПоУмолчанию(Доска, НастройкиКолонки, Наименование, Цвет) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	Набор.Отбор.Доска.Установить(Доска);
	Набор.Прочитать();

	Запись = Набор.Добавить();
	Запись.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	Запись.Доска = Доска;
	Запись.Номер = Набор.Количество();
	Запись.Наименование = Наименование;
	Запись.Цвет = Цвет;
	Запись.НастройкиКолонки = НастройкиКолонки;

	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
